Repository: n8rob/corpora
Catalog: french_haitian/archive/en-ht (1).tmx
Source language: en
Languages: ht

source: All of that flies in the face of what they did.
ht: Tout sa kontradi tout sa yo te fè.

source: That is the reason why I felt it was imperative that I presented you with this copy of the gay agenda.
ht: Sepou rezon sa ke'm te twouve sa enpòtan pou'm te montre'w kopi de kaye de moun ki omoseksyèl yo.

source: Because I figured if I made it funny, you wouldn't be as threatened.
ht: Paske, m'panse ke si'm te prezante'w sa nan yon fason ki komik, ou pa te'p santi ke m'ap menase'w.

source: I figured if I was a bit irreverent, you wouldn't find it serious.
ht: M'panse ke si'm te fè prezantasyon an yon ti jan derespektab, ou pa t'ap pran sa seryezman.

source: But when you see the map, and you see our state of Michigan -- it's legal to fire someone for being gay, lesbian, bisexual or transgendered, that it's legal to remove someone from their home because they're gay, lesbian, bisexual or transgendered, then you realize that this whole conversation about marriage equality is not about stripping someone's rights away, it's about granting them the rights that [have] already been stated.
ht: Men, lè'w gade kat jewografik peyi yan, ou wè eta nou an, ke yo rele Michigenn (Michigan) lan li legal si'w revoke yon moun paske'l omoseksyèl, lesbyèn, biseksyèl, oubyen transeksyèl, li legal tou, si'w mete yon moun deyò lakay yo paske yo se omoseksyèl, lesbyèn, biseksyèl, oubyen transeksyèl,

source: And we're just trying to walk in those rights that have already been stated, that we've already agreed upon.
ht: Epi, nou jis ap eseye itilize dwa yo, ki te deja deklare ke nou te deja aksepte.

source: There are people living in fear of losing their jobs so they don't show anyone who they really are right here at home.
ht: Gen moun k'ap viv, ki pè pèdi travay yo akoz de sa, yo pa montre okenn moun kiyès yo vrèman ye nan eta isit tou.

source: This isn't just about North Carolina; all those states that were clear, it's legal.
ht: Lekti sa, se pa jis sou Kawolin di Nò ke l'ap pale li vle pale sou lòt eta yo tou, kote aksyon sa yo legal.

source: If I could brag for a second, I have a 15-year-old son from my marriage.
ht: Si'm ka fè dyolè pou yon moman, m'gen yon ti gason ki gen 15 an ke maryaj mwen yan te fè'm kado.

source: He has a 4.0.
ht: Mwayèn li lekòl, sa pafè.

source: He is starting a new club at school, Policy Debate.
ht: L'ap kòmanse yon asosiyasyon lekòl li ya ki rele "Deba Politik".

source: He's a budding track star; he has almost every single record in middle school for every event that he competed in.
ht: Li se yon atlèt ki trè fò nan kouri li konn premye prèske nan chak evènman atletik ke'l patisipe ladan'l, nan lekòl li ya.

source: He volunteers.
ht: Li travay gratis pou kèk òganizasyon.

source: He prays before he eats.
ht: Li priye avan li manje.

source: I would like to think, as his father -- and he lives with me primarily -- that I had a little something to do with all of that.
ht: M'ta renmen panse, ke kòm papa'l -- se lakay mwen yan li plis rete --ke siksè'l yo, mwen te ede'l akonpli yo tout.

source: I would like to think that he's a good boy, a respectful young man. I would like to think that
ht: M'ta renmen panse ke'l se yon bon ti gason, yon ti moun ki respekte moun.

source: I've proven to be a capable father.
ht: M'ta renmen panse ke mwen pwouve ke'm se yon bon papa.

source: But if I were to go to the state of Michigan today, and try to adopt a young person who is in an orphanage, I would be disqualified for only one reason: because I'm gay.
ht: Men, si'm ta'l mande eta Michigenn jodi ya, pou'm adopte yon òfelen yo pa t'ap kite'm fè sa pou yon rezon sèlman: paske'm se omoseksyèl.

source: It doesn't matter what I've already proven, what I can do with my heart.
ht: Sa pa vle di anyen, menm si m'te gentan montre sa'm ka fè avèk kè'm.

source: It's because of what the state of Michigan says that I am that I am disqualified for any sort of adoption.
ht: Se akoz de sa eta Michigenn di ke'm ye ke yo pa t'ap kite'm adopte okenn timoun.

source: And that's not just about me, that's about so many other Michiganders, U.S. citizens, who don't understand why what they are is so much more significant than who they are.
ht: Epi, sa m'ap di la, se pa pwoblèm mwen sèlman ke'l ye se pwoblèn anpil moun ki rete Michigenn, moun ki se sitwayen Ameriken, ki pa konprann pou kisa, sa yo ye pi enpòtan ke kiyès yo ye.

source: This story just keeps playing over and over and over again in our country's history.
ht: Bagay sa, li rive anpil, anpil nan istwa peyi nou.

source: There was a time in which, I don't know, people who were black couldn't have the same rights.
ht: Te gen yon tan ke, moun ki te nwa pa't ka gen menm dwa ak moun ki blan.

source: People who happened to be women didn't have the same rights, couldn't vote.
ht: Epi, paske fanm pa't gen menm dwa ak gason, yo pa't ka vote nan eleksyon.

source: There was a point in our history in which, if you were considered disabled, that an employer could just fire you, before the Americans with Disabilities Act.
ht: Te gen yon tan nan istwa peyin'n nan, ke si'w te paralize fizikman oubyen mantalman, ke yo te ka jis revoke'w, avan egzistans de lwa ki rele "Lwa pou tout Ameriken ki Paralize (Americans with Disabilities Act).

source: We keep doing this over and over again.
ht: Nou kontinye fè menm bagay la ankò e ankò.

source: And so here we are, 2012, gay agenda, gay lifestyle, and I'm not a good dad and people don't deserve to be able to protect their families because of what they are, not who they are.
ht: Alò, ane sa, ane 2012 lan objektif de moun omoseksyèl yo, stil de vi moun omoseksyèl yo, epi ke'm se yon vye papa epi ke moun pa merite pou yo pwoteje fanmiy yo akoz de sa yo ye, pa akoz de kiyès yo ye.

source: So when you hear the words "gay lifestyle" and "gay agenda" in the future, I encourage you to do two things:
ht: Alò, lè'w tande mo swivan sa yo: "stil de vi omoseksyèl" avèk "objektif de moun omoseksyèl yo", mwen ankouraje'w fè de bagay:

source: One, remember the U.S. Constitution, and then two, if you wouldn't mind looking to your left, please. Look to your right.
ht: Premyeman, sonje Konstitisyon Etazini yan, epi, dezèmman, gade sou bò goch ou, sil vou plè, gade sou bò dwat ou.

source: That person next to you is a brother, is a sister.
ht: Moun sa ki bò kote'w la, se frè'w oubyen sè'w ke'l ye.

source: And they should be treated with love and respect.
ht: Akoz de sa, fòk ou trete yo ak lanmou e respè.

source: Imagine Alice has an idea, and she wants to share it.
ht: Imajine Alice, ki gen yon lide, Apre sa, li vle pou separe l.

source: There are so many ways to share an idea.
ht: Genyen anpil fason pou pataje yon lide.

source: She could draw a picture, make an engraving, write a song,
ht: Li te kapab fè yon desen, fè yon gravure, ekri yon chante pou yo chante,

source: send a telegraph, or an email.
ht: voye yon télégraphique, ou kouryèll yon.

source: But how are these things different?
ht: Men, si yo pa jan menm bagay sa yo ak?

source: And more importantly, why are they the same?
ht: Et pi enpòtan toujou, Poukisa yo menm bagay la tou?

source: This story is about the fundamental particle of all forms of communication.
ht: Parabòl sa a, se sou renn fondamentaux a de tout fòm kominikasyon.

source: It begins with a special skill you likely take for granted --
ht: Li konmanse ak yon talan espesyal probablement n' paske accordée-

source: language.
ht: lang.

source: All language allows you to take a thought -- or mental object -- and break it down in a series of conceptual chunks.
ht: Tout lang pèmèt ou bat yon- ou nan tèt objet- Et kraze l' nan yon seri de segments Jaspè.

source: These chunks are externalized using a series of signals - or 'symbols.'
ht: Segments sa yo externalized w ap itilize yon seri de signaux- ou 'senbòl.'

source: Humans express themselves using a variation in sound and physical action - as do chirping birds - and dancing bees - and man-made machines, exchanging a dancing stream of eletrical vibrations.
ht: L' ekspwime yo w ap itilize yon varyasyon nan son Et fizik aksyon- menm jan fè zwazo chirping- Et dans abeilles- ak machin ki, peyi nan yon ravin dans de eletrical vibrations.

source: Even our bodies are built according to instructions stored inside microscopic books - known as 'DNA.'
ht: Menm nan kò nou ki te konstwi selon sa pou nou fè sere anndan piti piti piti liv-ke yo rekonèt kòm 'DNA.'

source: All are different forms of one thing - 'information.'
ht: Tout yo diferan fòmilè nan yon sèl bagay-'enfòmasyon.'

source: In simplest terms, information is what allows one mind to influence another.
ht: Nan tèm plus, enfòmasyon se sa ki pèmèt yon sèl lide pou enfliyanse yon lòt.

source: It's based on the idea of communication as selection.
ht: Li chita sou idée de kominikasyon pou te chwazi.

source: Information - no matter the form - can be measured using a fundamental unit - in the same way we can measure the mass of different objects - using a standard measure - such as kilograms or pounds.
ht: Enfòmasyon-nenpòt fòm- ka sèvi pou mezire w ap itilize yon fondamentaux inite w la- menm jan nou ka mezire Mès la de diferan objets-itilize yon estanda mesure- tankou kg ou liv.

source: This allows us to precisely measure and compare the weight of, say, rocks, water, or wheat - using a scale.
ht: Sa pèmèt nou ojis mezire Et konpare peze, di, wòch, dlo, ak ble- w ap itilize yon sistèm yo sèvi.

source: Information, too, can be measured and compared using a measurement called 'entropy.'
ht: Enfòmasyon, tou, kapab être mesurés ak te konpare w ap itilize yon mezi ki te rele 'entropie'.

source: Think of it as an information scale.
ht: Panse de li kòm yon enfòmasyon échelle.

source: We intuitively know that a single page from some unknown book has less information than the entire book.
ht: Nou intuitive konnen sa yon moun ki pa marye paj nan kèk enkoni liv gen enfòmasyon mwens pase tout woulo liv la.

source: We can describe exactly how much using a unit called the 'bit' - a measure of surprise.
ht: Nou kapab dekri exactement ki kantite w ap itilize yon inite w la te rele 'moso'- yon mezi savann dezole.

source: So, no matter how Alice wants to communicate a specific message - hieroglyphics, music, computer code - each would contain the same number of bits, though in different densities.
ht: Se konsa, nenpòt ki jan Alice vle pou kominike yon mesaj byen presi- hieroglyphics, mizik, konpitè kòd- chak ta contiennent menm nonb lan ki pyès, si nan diferan densité.

source: And a bit is linked to a very simple idea - the answer to a yes-or-no question.
ht: Ak yon ti an gen pou yon senp lide- -n a kesyon wi-ou ki pa reponn.

source: Think of it as the 'language of coins.'
ht: Panse de li kòm 'lang monnen.'

source: So how is information actually measured?
ht: Se konsa jan enfòmasyon aktyèlman mesure?

source: Does information have a speed limit?
ht: Èske enfòmasyon genyen yon limit vitès?

source: A maximum density?
ht: Yon maksimòm dansite?

source: Information theory holds the exciting answer to these questions.
ht: Enfòmasyon teori est panse a eksitan repons pou kesyon sa yo.

source: It's an idea over 3000 years in the making.
ht: Li gen yon lide pase 3000 an nan fè a.

source: But before we can understand this, we must step back - and explore, perhaps, the most powerful invention in human history - the alphabet.
ht: Men, anvan sa, nou ka konprann sa a, nou dwe étape tounen- Et egzamine, petèt, a ki pi pwisan envansyon nan istwa moun- Alfabèt a.

source: And for this, we return to the cave.
ht: E pou sa, nou tounen la cave.

source: All right, we're on problem 44.
ht: Byen, nou ap sou pwoblèm 44.

source: And they said, which is the factored form of 3a squared minus 24ab plus 48b squared?
ht: Epi yo di l ':-ki se fòmilè a pris de 3a au moins 24ab plis 48b au?

source: And if this confuses you with a's and b's instead of an x there, I just like to think of in this case, this looks like an x squared.
ht: Et si sa confond nou ak yon a Et b's olye de yon x la, mwen sèlman renmen pou panse a nan ka sa, sa sanble yon x au.

source: So I like to think of it the same way I would think of it in terms of if this was an x squared minus some number times x plus some other number.
ht: Se konsa mwen renmen l ' menm jan mwen ta ka panse de li tèm si sa a te yon x au moins nombre kèk fwa x plis kèk lòt moun.

source: So let's put that in the back of your head.
ht: Se konsa nou mete ki dèyè tèt ou.

source: If that's confuses you, don't worry about it.
ht: Si sa a confond nou la a, pa enkyete de li.

source: But the first thing I like to do is try to get rid of the coefficient on the, in this case, the a squared term.
ht: Men, premye bagay mwen vle fè se eseye debarase li de la koefisyan sou a, nan ka sa, a yon tèm au.

source: Let's see if we can factor out a number.
ht: An n wè si nou ka facteur soti yon foul moun yo.

source: All of these are divisible by 3.
ht: Tout moun sa yo divisible pa 3.

source: 3 is divisible by 3, 24 is divisible by 3 and 48 is divisible by 3.
ht: 3 divisible pa 3, 24 divisible pa 3 Et 48 se divisible pa 3.

source: So we should be able to factor out a 3, so let's do that.
ht: Se poutèt sa, nou dwe kapab pou dekonpoze an faktè soti yon 3, se konsa nou fè sa.

source: So that is equal to 3 times a squared minus 8ab.
ht: Se poutèt sa se rive fè fwa yon au moins 8ab.

source: 24 divided by 3 is 8 and there's a minus in front of it.
ht: 24 ki divize an 3 se 8 Et la se yon mwens devan l.

source: Plus 48 divided by-- 3.
ht: Plis 48 divize pa - 3.

source: My brain was getting ahead of me.
ht: Sèvo m' t' ap devan m.

source: 48 divided by 3 is 16b squared.
ht: 48 divize an 3 se 16b au.

source: Now to factor this we have to think about it as, are there two numbers-- well, think of it.
ht: Koulye a, pou dekonpoze an faktè sa nou bezwen panse osijè de sa kòm, sont la de numéros - byen, panse de li.

source: Let me rewrite this a little bit.
ht: Kite m' réécrire sa a. Se pou yon ti tan.

source: If we view a as kind of the independent variable-- you wouldn't have to do it, but I just wanted you to visualize it properly.
ht: Si nou wè kòm yon type de varyab endepandan - ou pa gen pou yo fè l, men, mwen te jis vle ou pou visualiser li correctement.

source: 3a squared minus 8b times a plus 16b squared.
ht: 3a au moins au plus 16b yon fwa 8b.

source: So if we viewed a squared as kind of the independent variable or the x term, so now this kind of has the shape of polynomials that hopefully you're used to factoring a little bit.
ht: Si nou wè yon au li kòm kalite endepandan varyab ou a x term, sa koulye a, sa gen ti jan fòm de polynômes ak lespwa ke ou ap itilize pou tcheke repons nan yon ti kras.

source: We just have to think, OK, are there two numbers that add up to minus 8b, and that when I multiply the two numbers, I get 16b squared?
ht: Nou jis gen panse, pa pi mal, ki genyen anpil de moun ki gen sans a moins 8b, Et sa lè mwen eple de anpil moun, mwen gen 16b au?

source: So first all, the number is going to be in terms of b, obviously.
ht: Se poutèt sa, premye tout, dapre resansman pwal tèm b, evidamman.

source: Because if I'm adding them and I get a b and-- I get b's.
ht: Paske si mwen menm ki ajoute ke yo ak mwen jwenn yon b Et - m obtenez b's

source: And if I square them I get a b squared.
ht: Et si mwen carré yo mwen jwenn yon b au.

source: And it also makes me lead to it's the same number, just used twice.
ht: Li te anplis fè m' yo ak plon pou li se menm nonb, jis te itilize pandan de fwa.

source: Otherwise, it would be weird to get a squared here.
ht: Otreman, li ta bizarre pou jwenn yon au isit la.

source: So the number that should pop out, you say, OK, what two numbers add up to minus 8 and that when I square it is equal to 16?
ht: Se konsa, moun ki ta dwe pete, nou di: bon, de sa anpil moun ajoute jiska moins 8 Et sa lè mwen carré sa ki egal a 16?

source: Minus 4, right?
ht: Moins 4, dwat?

source: Minus 4, minus 4 is minus 8.
ht: Moins 4, moins 4 se moins 8.

source: Minus 4 squared is 16.
ht: 4 Au moins se 16.

source: So the number we're talking about is minus 4b, right?
ht: Se konsa la nimewo nap pale a se moins 4b, dwat?

source: Minus 4b. b, that's a b.
ht: Moins 4b. b, ki se yon b.

source: Plus minus 4b is equal to minus 8b.
ht: Plis moins 4b egal a moins 8b.

source: And minus 4b squared is equal to 16b squared.
ht: Et 4b au moins 16b au egal-ego.

source: So we can factor this out to be 3-- let me switch colors.
ht: Se konsa, nou ka dekonpoze an faktè sa a soti pou 3 - kite m' chanje koulè.

source: 3 times.
ht: 3 fwa.

source: We said minus 4b is the number.
ht: Nou te di moins 4b se nonm lan.

source: When you add it twice you get minus 8b.
ht: Lè ou ajoute sa pandan de fwa ou jwenn moins 8b.

source: And you square it, you get that.
ht: Apre sa, ou carré li, ou jwenn sa.

source: So it's a minus 4b times a minus 4b.
ht: Se poutèt sa yon moins 4b fwa yon moins 4b.

source: And that is choice C.
ht: E se pou sa chwa c

source: Next problem, 40-- did I skip 45? I did.
ht: Pwochen pwoblèm, 40 - a mwen manke gen 45 kan? mwen te.

source: Let me copy and paste 45 in here.
ht: Kite m' copie pat gen 45 kan isit la.

source: Can't skip problems.
ht: Pa kapab evite pwoblèm.

source: Copy and paste it in.
ht: Copie Et pat li nan.

source: OK.
ht: Oke.

source: Maybe over do on top of this one.
ht: Gen dwa pase fè sou dèyè sa a.

source: Let me see if I can erase this.
ht: Fè m' wè si mwen ka efase sa a.

source: Look at that.
ht: Gade sa.

source: All right, now I can paste 45 and we're ready to go.
ht: Bon, koulye a mwen kapab pat gen 45 kan Et nou pwèt pou nou ale.

source: Which is a factor of x squared minus 11x plus 24?
ht: Ki se yon faktè x au moins 11 x plis 24?

source: So there's two ways to do it.
ht: Se konsa pa gen de jan pou yo fè l.

source: You could just factor this.
ht: Ou te kapab sèlman facteur sa a.

source: Well, that's the easiest way.
ht: Geri, ke fason ki pli fasil.

source: Or you could test for 0's.
ht: Ou te kapab tès pou 0 a.

source: But we'll just factor.
ht: Men nou jis ap facteur.

source: So if we wanted to say-- well, let me just-- x squared minus 11x plus 24.
ht: Se konsa si nou te vle pou yo di: - geri, kite m' sèlman - x au moins 11 x plis 24.

source: So just like the last problem you have to say, what two numbers when I add them equal to minus 11, and when I multiply them, is equal to positive 24?
ht: Se konsa senpleman tankou dènye pwoblèm ki genyen ou gen pou di, de ki numéros lè mwen ajoute yo rive fè moins 11, e lè mwen grennen timoun yo, se sa ki egal a pozitif 24?

source: So first of all, if I'm multiplying them and I get a positive 24, they're either both positive or they're both negative.
ht: Se konsa premye tou, si mwen menm multipliant yo e mwen yon 24 pozitif, yo ap soit les pozitif ou yo ap les negatif.

source: Since this is a negative number it tells me that they both have-- I mean they both can't be positive.
ht: Depi lè sa a se yon nonm negatif li di m' sa yo les en-mwen vle di yo tou de pa kapab pozitif.

source: You can't add two positive numbers and end up with a negative.
ht: Ou pa ka ajoute de numéros pozitif Et fini ak yon négatif.

source: So we're going to deal with two negative numbers.
ht: Se konsa nou pral a kontra avèk de numéros negatif.

source: So essentially, what two negative numbers when I add them equals minus 11 and when I multiplying them equals 24?
ht: Esansyèlman, ki de negatif anpil lè mwen ajoute yo à moins 11 Et lè mwen multipliant yo à 24?

source: And hopefully, 8 and 3 pop out at you.
ht: Ak, 8 Et 3 pòp nan ou.

source: Because minus 8 plus minus 3 is equal to minus 11.
ht: Paske moins 8 plis moins 3 egal a moins 11.

source: That's that.
ht: Sa se sa.

source: And then minus 8 times minus 3 is positive 24.
ht: Et puis mwens 8 fwa moins 3 se 24 pozitif.

source: So this can be factored as x minus 8 times x minus 3.
ht: Se poutèt sa kapab être pris kòm x moins 8 fwa x moins 3.

source: And if we look at their choices, they had x minus 3 there.
ht: Et si nou gade sou chwa yo, yo te gen x moins 3 a.

source: And of course, don't get this confused.
ht: Pou yo men wi, pa pran sa a Confusion.

source: If they said, solve this equation, right?
ht: Si yo reponn li: rezoud sa a ekwasyon, droit?

source: This is just an expression.
ht: Sa se jis yon ekspresyon.

source: Now it becomes an equation if we put an equal sign.
ht: Kounye a li parèt tankou yon ekwasyon si nou fè yon bon siy.

source: Then we would have this equaling 0 and then you could say the roots of this polynomial or the solutions to the equation are what makes this true.
ht: Lè sa a nou pwal gen sa equaling 0, lè sa a ou te kapab di rasin de polinòm sa a ou solisyon yo pou ekwasyon a sont Kisa ki fè sa vre.

source: And then the solutions wouldn't be minus 8 and minus 3.
ht: Et puis solisyon pas être moins 8 Et moins 3.

source: The solutions would be what makes this 0.
ht: Solisyon ta dwe Kisa ki konn 0 sa a.

source: So it's be x is equal to 8 would make this 0, or x is equal to 3 would make that 0.
ht: Se konsa, li te gen x se bon pou 8 ta fè 0 sa a, ou se x bon pou 3 ta fè sa 0.

source: But anyway, I'm going off on a tangent and that's not what they asked you.
ht: Men, de tout fason, m' ap kouri tanjant yon Et sa a, se pa sa yo te mande ou.

source: But I think that confuses people sometimes.
ht: Men mwen panse ke confond moun pafwa.

source: OK, 46.
ht: DAKÒ, 46 ZAN.

source: Which of the following shows 9t squared plus 12t plus 4 factored completely?
ht: Kilès sa a montre 9t au plus 12t plis 4 pris nèt?

source: OK, now this is an interesting one because immediately, when
ht: Dakò, koulye a se yon enteresan UN paske imedyatman, lè

source: I look at the numbers, there's not one number that I can just factor out of everything.
ht: Mwen gade sou anpil la, se pa yon nimewo sa mwen kapab sèlman dekonpoze an faktè soti nan tout bagay.

source: 9, 12, and 4, they don't have any common factors, so I can't just do that simplification.
ht: 9, 12, Et 4, yo pa gen okenn faktè komen, se konsa mwen pa kapab jis fè senplifikasyon sa.

source: So we're going to do a little bit more complexity.
ht: Se konsa nou pral fè yon ti jan plis konpleksite.

source: But the best way to think about is whatever's on the t squared, this is probably kind of-- this whole expression, if we're trying to factor it into two binomials or into one binomial, this is going to be the first term of that binomial squared.
ht: Men, pi bon fason pou panse osijè de, se tou sa se sou t la au, sa se pwobableman ti jan de - espresyon tout sa a, si Nap chèche pou dekonpoze an faktè li nan de binomials pa antre nan youn binomyal, sa pwal premye an tèm de sa binòm au.

source: So we're going to be dealing with something like 3t.
ht: Se poutèt sa, nou pral fè gen pou wè ak yon bagay tankou 3 g.

source: I'm just taking the square root of 9t squared.
ht: Mwen ap annik pran rasin kare 9t au.

source: 3t plus some number.
ht: 3t plis nombre kèk.

source: Let's say plus a.
ht: An n ap di plis yon.

source: Times 3t plus b.
ht: Fwa 3t plis b.

source: And now we can actually just multiply this out and see what happens.
ht: Et koulye a nou ka aktyèlman jis eple a wa wè sa k rive koukouloukou.

source: Well first of all, they gave us a multiple choice.
ht: Anvan tout bagay byen, yo te bay yon chwa miltip yo.

source: We could just multiply these out and see what happens.
ht: Nou te kapab sèlman grennen timoun sa yo an konesans ak wè sa k rive koukouloukou.

source: But let's pretend like that they didn't give us choices and we had to do this in a vacuum.
ht: Men, ann pretann tankou sa yo pa t ba nou chwa e nou pa gen pou w fè sa nan yon bale.
